app/controllers/pages_controller.rb

	def index
		@posts = Post.limit(5)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 5]]